penguinSouvenirs = {
    '1629596387': {"location": " 木卫二：卡德马斯山脊", "name": "🐧#1"},
    '271815222': {"location": "木卫二：无尽之井", "name": "🐧#2"},
    '3880966469': {"location": "木卫二：薄暮废墟", "name": "🐧#3"},
    '3420140384': {"location": "木卫二：布瑞Exo科学所", "name": "🐧#4"},
    '3890313479': {"location": "木卫二：猎犬座深渊", "name": "🐧#5"},
    '290570570': {"location": "木卫二：重生的里斯入口", "name": "🐧#6"},
    '3254863625': {"location": "木卫二：枢纽", "name": "🐧#7"},
    '1313979588': {"location": "木卫二：凯尔高地", "name": "🐧#8"},
    '1610085355': {"location": "木卫二：永恒", "name": "🐧#9"}
}


egg = {
    '1101252171': {"location": "幽梦之城：破碎王座", "name": "🥚#1"},
    '1101252168': {"location": "幽梦之城：破碎王座", "name": "🥚#2"},
    '1101252169': {"location": "幽梦之城：破碎王座", "name": "🥚#3"},
    '1101252174': {"location": "幽梦之城：破碎王座", "name": "🥚#4"},
    '1101252175': {"location": "幽梦之城：破碎王座", "name": "🥚#5"},
    '1101252172': {"location": "幽梦之城：破碎王座", "name": "🥚#6"},
    '1101252173': {"location": "幽梦之城：破碎王座", "name": "🥚#7"},
    '1101252162': {"location": "幽梦之城：破碎王座", "name": "🥚#8"},
    '1101252163': {"location": "幽梦之城：破碎王座", "name": "🥚#9"},
    '1118029885': {"location": "最后一愿：睽目之塔", "name": "🥚#10"},
    '1118029884': {"location": "最后一愿：始源尖塔", "name": "🥚#11"},
    '1118029887': {"location": "最后一愿：语声要塞", "name": "🥚#12"},
    '1118029886': {"location": "最后一愿：双魂大厅", "name": "🥚#13"},
    '1118029881': {"location": "最后一愿：双魂大厅", "name": "🥚#14"},
    '1118029880': {"location": "腐化：伊琳圣庙", "name": "🥚#15"},
    '1118029883': {"location": "腐化：伊琳圣庙", "name": "🥚#16"},
    '1118029882': {"location": "幽梦之城：预言者隐所", "name": "🥚#17"},
    '1118029877': {"location": "幽梦之城：预言者隐所", "name": "🥚#18"},
    '1118029876': {"location": "幽梦之城：预言者隐所", "name": "🥚#19"},
    '1067696996': {"location": "幽梦之城：艾希拉花园", "name": "🥚#20"},
    '1067696997': {"location": "幽梦之城：艾希拉花园", "name": "🥚#21"},
    '1067696998': {"location": "幽梦之城：迪瓦里安迷雾", "name": "🥚#22"},
    '1067696999': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#23"},
    '1067696992': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#24"},
    '1067696993': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#25"},
    '1067696994': {"location": "上维挑战：星光大殿", "name": "🥚#26"},
    '1067696995': {"location": "上维挑战：星光大殿", "name": "🥚#27"},
    '1067697004': {"location": "上维挑战：星光大殿", "name": "🥚#28"},
    '1067697005': {"location": "上维挑战：克蕾丝脊柱", "name": "🥚#29"},
    '1084474583': {"location": "上维挑战：克蕾丝脊柱", "name": "🥚#30"},
    '1084474582': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#31"},
    '1084474581': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#32"},
    '1084474580': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#33"},
    '1084474579': {"location": "上维挑战：预言者隐所", "name": "🥚#34"},
    '1084474578': {"location": "上维挑战：预言者隐所", "name": "🥚#35"},
    '1084474577': {"location": "上维挑战：远日点之栖", "name": "🥚#36"},
    '1084474576': {"location": "上维挑战：远日点之栖", "name": "🥚#37"},
    '1084474591': {"location": "上维挑战：远日点之栖", "name": "🥚#38"},
    '1084474590': {"location": "上维挑战：艾希拉花园", "name": "🥚#39"},
    '1034141726': {"location": "上维挑战：艾希拉花园", "name": "🥚#40"}}


record = 4175199845


bones = {
    '1387596459': {"name": "🦴#1", "location": '破碎王座：第一关', 'lore': '信仰屠戮I'},
    '1370818864': {"name": "🦴#2", "location": '破碎王座：第二关', 'lore': '宇宙回旋II'},
    '1370818871': {"name": "🦴#3", "location": '破碎王座：第二关', 'lore': '前言'},
    '1370818868': {"name": "🦴#4", "location": '破碎王座：第三关', 'lore': '新生I'},
    '1387596461': {"name": "🦴#5", "location": '幽梦之城：克蕾丝脊柱', 'lore': '信仰屠戮III'},
    '1370818865': {"name": "🦴#6", "location": '幽梦之城：克蕾丝脊柱', 'lore': '宇宙回旋III'},
    '1387596458': {"name": "🦴#7", "location": '幽梦之城：女王大厅', 'lore': '信仰屠戮II'},
    '1370818869': {"name": "🦴#8", "location": '腐化', 'lore': '新生II'},
    '1370818867': {"name": "🦴#9", "location": '腐化', 'lore': '宇宙回旋I'},
    '1387596456': {"name": "🦴#10", "location": '剧情：黑暗修道院', 'lore': '沉迷III'},
    '1370818878': {"name": "🦴#11", "location": '上维挑战：溺亡之愿海湾', 'lore': '宇宙回旋IV'},
    '1370818866': {"name": "🦴#12", "location": '上维挑战：星光大殿', 'lore': '新生III'},
    '1387596463': {"name": "🦴#13", "location": '上维挑战：远日点之栖', 'lore': '强加者I'},
    '1387596460': {"name": "🦴#14", "location": '上维挑战：艾希拉花园', 'lore': '异教论'},
    '1370818879': {"name": "🦴#15", "location": '上维挑战：克蕾丝脊柱', 'lore': '沉迷I'},
    '1387596457': {"name": "🦴#16", "location": '上维挑战：预言者隐所', 'lore': '沉迷II'}
}


增幅s = {
    '2181119074': {'name': '✈#1', 'location': '增幅：布瑞Exo科学所'},
    '2181119075': {'name': '✈#2', 'location': '增幅：永恒'},
    '2181119072': {'name': '✈#3', 'location': '增幅：创世所'},
    '2181119073': {'name': '✈#4', 'location': '增幅：重生的里斯入口'},
    '2181119078': {'name': '✈#5', 'location': '增幅：技术专家的烙印'},
    '2181119079': {'name': '✈#6', 'location': '增幅：凯尔高地'},
    '2181119076': {'name': '✈#7', 'location': '增幅：枢纽'},
    '2181119077': {'name': '✈#8', 'location': '增幅：无尽之井'}}


nightmare = {
    '202553883': {'name': '', 'time': ''},
    '1014773306': {'name': '', 'time': ''},
    '2771763709': {'name': '', 'time': ''},
    '3006411263': {'name': '', 'time': ''},
    '2304272073': {'name': '', 'time': ''},
    '1554766171': {'name': '', 'time': ''},
    '2358910877': {'name': '', 'time': ''},
    '7358862': {'name': '', 'time': ''}
}

cats = {
    '2576690974': {'name': '🐱#1', 'location': '幽梦之城：滨岸'},
    '2420371297': {'name': '🐱#2', 'location': '幽梦之城：艾希拉花园'},
    '2253687296': {'name': '🐱#3', 'location': '幽梦之城：克蕾丝脊柱'},
    '1159650715': {'name': '🐱#4', 'location': '幽梦之城：克蕾丝脊柱'},
    '2853314242': {'name': '🐱#5', 'location': '幽梦之城：雷亚希尔维亚'},
    '56362725': {'name': '🐱#6', 'location': '幽梦之城：预言者隐所'},
    '4262976548': {'name': '🐱#7', 'location': '幽梦之城：预言者隐所'},
    '3629051903': {'name': '🐱#8', 'location': '幽梦之城：迪瓦里安迷雾'},
    '3255812950': {'name': '🐱#9', 'location': '幽梦之城：雷亚希尔维亚'}
}

# 称号 = {
#     '3298130972': {'name': '天下无双', 'gold': 10},
#     '3464275895': {'name': '征服者', 'gold': 10},
#     '1343839969': {'name': '不羁者', 'gold': 15},
#     '1556658903': {'name': '德瑞捷', 'gold': 16},
#     '2482004751': {'name': '破碎凌霄'},
#     '1087927672': {'name': '天选者'},
#     '540377256': {'name': '光影后裔'},
#     '1561715947': {'name': '守望者'},
#     '2584970263': {'name': '先知'},
#     '2909250963': {'name': '证悟者'},
#     '3214425110': {'name': '破咒者'},
#     '1384029371': {'name': '魅痕克星'}
# }


# 传承称号 = {
#     '2126548397': '天下无双-S12',
#     '2980266417': '天下无双-S11',
#     '2072890963': '天下无双-S10',

#     '4167244320': '征服者-S12',
#     '2056461735': '暗影',
# }


exos = {

    "3854379920": {'name': '🐾#1', 'location': '木卫二：隐匿虚空'},
    "1287812596": {'name': '🐾#2', 'location': '木卫二：猎犬座深渊'},
    "1291596818": {'name': '🐾#3', 'location': '木卫二：无尽之井'},
    "2578791723": {'name': '🐾#4', 'location': '木卫二：卡德马斯山脊'},
    "2039102766": {'name': '🐾#5', 'location': '木卫二：永劫地狱'},
    "2717332017": {'name': '🐾#6', 'location': '木卫二：布瑞Exo科学所'},
    "3239366412": {'name': '🐾#7', 'location': '木卫二：创世所'},
    "4176343351": {'name': '🐾#8', 'location': '木卫二：地堡E15'},
    "3497190125": {'name': '🐾#9', 'location': '木卫二：薄暮废墟'}
}


暗熵碎片s = {
    '2677830030': {'name': '🔷#1', 'location': '木卫二：猎犬座深渊'},
    '523132396': {'name': '🔷#2', 'location': '木卫二：隐匿虚空'},
    '2927552589': {'name': '🔷#3', 'location': '木卫二：卡德马斯山脊'},
    '3482887819': {'name': '🔷#4', 'location': '木卫二：薄暮废墟'},
    '2679813844': {'name': '🔷#5', 'location': '木卫二：地堡E15'},
    '3527611025': {'name': '🔷#6', 'location': '木卫二：重生的里斯入口'},
    '951414128': {'name': '🔷#7', 'location': '木卫二：凯尔高地'},
    '1217064983': {'name': '🔷#8', 'location': '木卫二：技术专家的烙印'},
    '1146417010': {'name': '🔷#9', 'location': '木卫二：创世所'}
}


证章 = {
    '木卫二收藏家': {'泰坦': 1369220652, '猎人': 2092820752, '术士': 4102170061},
    '影临赛季': {'泰坦': 1996848060, '猎人': 582419680, '术士': 1840210717},
    '奥斯里斯试炼：老兵门徒': {'泰坦': 3632206043, '猎人': 907398217, '术士': 3809174270},
    '黎明赛季': {'泰坦': 605410965, '猎人': 3566355363, '术士': 587677888},
    '不朽赛季': {'泰坦': 4107433557, '猎人': 805054563, '术士': 3083337344},
    '月球漫游者': {'泰坦': 3304578900, '猎人': 1813275880, '术士': 1127243461},
    '年票：丰盈赛季': {'泰坦': 4108787242, '猎人': 1481732726, '术士': 1040898483},
    '年票：《莫测鬼牌》': {'泰坦': 2516153921, '猎人': 1521772351, '术士': 24162924},
    '年票：《黑色军武》': {'泰坦': 272447096, '猎人': 397176300, '术士': 7761993},
    '目的地：幽梦之城': {'泰坦': 1115203081, '猎人': 964388375, '术士': 3711698756},
    '目的地：《遗落之族》': {'泰坦': 1003644562, '猎人': 3149147086, '术士': 437406379},
    '目的地：《冥王诅咒》和《战争思维》': {'泰坦': 604768449, '猎人': 2180056767, '术士': 1172293868},
    '目的地：猩红战争': {'泰坦': 1893032045, '猎人': 1080375723, '术士': 1187972104},
    '异域：猩红战争': {'泰坦': 1875194813, '猎人': 2607543675, '术士': 2084683608},
    '异域：《冥王诅咒》和《战争思维》': {'泰坦': 454888209, '猎人': 2283697615, '术士': 1367826044},
    '异域：《遗落之族》': {'泰坦': 3784478466, '猎人': 3233768126, '术士': 2591952283},
    '烈火锻造': {'泰坦': 1802049362, '猎人': 543101070, '术士': 1860141931},
    '收藏玩家': {'泰坦': 2652561747, '猎人': 1234074769, '术士': 51250598},
    '突袭：深岩墓室': {'泰坦': 2594170658, '猎人': 859539038, '术士': 3816074171},
    '神圣使命': {'泰坦': 2721277575, '猎人': 278453589, '术士': 5678666},
    '突袭：最后一愿': {'泰坦': 558738844, '猎人': 308119616, '术士': 282080253}
}


赛季挑战 = {
    '1371596488': '第1周',
    '1371596491': '第2周',
    '1371596490': '第3周',
    '1371596493': '第4周',
    '1371596492': '第5周',
    '1371596495': '第6周',
    '1371596494': '第7周',
    '1371596481': '第8周',
    '1371596480': '第9周',
    '2058046696': '第10周',
    '193232030': '天选赛季'
}


前兆 = {
    '碎片': {
        '1437052814': {
            'name': '第一周：答案的虚构',
            'entries': {
                '264102772': {'name': '🏷#1', 'location': '卡巴尔尸体'},
                '2894171970': {'name': '🏷#2', 'location': '散落的零件'},
                '1117915875': {'name': '🏷#3', 'location': '万兽园飞船'},
                '2308647693': {'name': '🏷#4', 'location': '乙太存储罐'},
                '2157957057': {'name': '🏷#5', 'location': '卡鲁斯投影'}


            }
        },
        '1437052815': {
            'name': '第二周：序列中的一环',
            'entries': {
                '2186009480': {'name': '🏷#1', 'location': '互动面板'},  # 1
                '3751015190': {'name': '🏷#2', 'location': '炮台残骸'},  # 2
                '1025009653': {'name': '🏷#3', 'location': '喷气背包'},  # 3
                '4054311042': {'name': '🏷#4', 'location': '魑魅尸体'},  # 4
                '1101928705': {'name': '🏷#5', 'location': '地上的机灵'},
                '788467415': {'name': '🏷#6', 'location': '最后的圣杯'},




            }
        },  # 10959788
        '1437052812': {
            'name': '第三周：所有散落的碎片',
            'entries': {
                '2179257544': {'name': '🏷#1', 'location': '小机器人'},
                '2780423630': {'name': '🏷#2', 'location': '天线杆'},
                '4048960077': {'name': '🏷#3', 'location': '电子面板'},
                '3546636567': {'name': '🏷#4', 'location': 'Boss房旗帜'},
            }
        }
    },
    '成就': {
        '952432579': '书页：记忆的束缚'
    }
}

DSC = {
    '挑战': {
        '22094034': '第一关：红色流浪者',
        '64856166': '第二关：复制的复制',
        '337542929': '第三关：各行各业',
        '2530940166': '第四关：四号核心'
    },
    'Phase': {
        'a': 'b'
    }
}
# 326786556 +2巅峰球
# 326786556

巅峰 = {
    "825965416": '预言',
    '1086730368': '先知',
    '2029743966': '日落10w分',
    '1713200903': 'Exo挑战',
    '3312774044': '熔炉周常',
    '3448738070': '智谋周常',
    '3927548661': '前兆',
    '1437935813': '先锋打击',
    '3603098564': {'name': '公会周常', 'type': 'availableQuests'},
    # '帝国猎杀': {
    #     '2205920677': '帝国猎杀：暗影女祭司',
    #     '4173217513': '帝国猎杀：勇士',
    #     '5517242': '帝国猎杀：技术专家'
    # }
}

宗师 = {
    '天选赛季': {
        '1820446245': '宗师：恶魔巢穴',
        '1404404279': '宗师：军火交易商',
        '2867134615': '宗师：试炼场',
        '8651357': '宗师：堕落者S.A.B.E.R.',
        '4018693329': '宗师：虚无典狱官',
        '1451485767': '宗师：洞悉终界'},
    '狂猎赛季': {
        '467599901': '宗师：虫巢据点',
        '1260338084': '宗师：玻璃小径',
        '3716806862': '宗师：倒置尖塔',
        '3054857469': '宗师：移民号的坠毁',
        '632127367': '宗师：耻辱',
        '2363370539': '宗师：猩红要塞',
    }
}

征服者 = {
    '天选赛季': '3464275895',
    '狂猎赛季': '4167244320',
    '影临赛季': '2980266417',
    '英杰赛季': '2226626398'
}

机灵 = {
    '3060958463': {'name': '📕#1', 'location': '月球：弓手界线'},
    '165164586': {'name': '📕#2', 'location': '月球：世界坟墓'},
    '1926293609': {'name': '📕#3', 'location': '月球：欧里克斯神庙'},
    '4085847388': {'name': '📕#4', 'location': '月球：控制室'},
    '3553369003': {'name': '📕#5', 'location': '月球：召唤深渊'},
    '1176209846': {'name': '📕#6', 'location': '月球：月球战场'},
    '3894429461': {'name': '📕#7', 'location': '月球：光能之锚'},
    '2780856872': {'name': '📕#8', 'location': '月球：巨坑'},
    '795077111': {'name': '📕#9', 'location': '月球：骸骨之环'},
    '3487734533': {'name': '📕#10', 'location': '月球：地狱入口'}
}


玉兔 = {
    '4062796495': {"name": "🐇#1", 'location': '月球：光能之锚'},
    '269847098': {"name": "🐇#2", 'location': '月球：地狱入口'},
    '957600697': {"name": "🐇#3", 'location': '月球：弓手界线'},
    '2293092716': {"name": "🐇#4", 'location': '月球：悲伤港口'},
    '2779900411': {"name": "🐇#5", 'location': '月球：K1后勤区'},
    '3728157446': {"name": "🐇#6", 'location': '月球：K1启示区'},
    '3977481189': {"name": "🐇#7", 'location': '月球：骸骨之环'},
    '1568227000': {"name": "🐇#8", 'location': '月球：黑夜之穹'},
    '2115406343': {"name": "🐇#9", 'location': '月球：欧里克斯神庙'}
}

赛季 = {
    '年三': {1743682818: "不朽",
           1743682819: "黎明",
           2809059425: "英杰",
           2809059424: "影临"},
    '年四': {2809059427: "狂猎",
           2809059426: "天选"}
}

线索 = {
    'Week1': {
        '264102772': {'name': '1️⃣#1', 'location': ''},
        '1117915875': {'name': '1️⃣#2', 'location': '大房间-万兽园飞机'},
        '2157957057': {'name': '1️⃣#6', 'location': ''},
        '2308647693': {'name': '1️⃣#4', 'location': ''},
        '2894171970': {'name': '1️⃣#5', 'location': ''}
    },

    'Week2': {
        '788467415': {'name': '2️⃣#1', 'location': ''},
        '1025009653': {'name': '2️⃣#2', 'location': ''},
        '1101928705': {'name': '2️⃣#3', 'location': ''},
        '2186009480': {'name': '2️⃣#4', 'location': ''},
        '3751015190': {'name': '2️⃣#5', 'location': ''},
        '4054311042': {'name': '2️⃣#6', 'location': ''}
    },

    'Week3': {
        '2179257544': {'name': '3️⃣#1', 'location': '小机器人'},
        '2780423630': {'name': '3️⃣#2', 'location': '天线杆'},
        '4048960077': {'name': '3️⃣#3', 'location': '电子面板'},
        '3546636567': {'name': '3️⃣#4', 'location': 'Boss房旗帜'},

    }
}

称号 = [
    {'description': '完成所有天下无双成就。', 'hash': '1733555826', 'name': '天下无双'},
    {'description': '完成所有宗师成就。', 'hash': '3776992251', 'name': '征服者'},
    {'description': '完成职业生涯中所有完整英勇和荣耀等级成就。', 'hash': '2107507397', 'name': '不羁者'},
    {'description': '完成所有智谋成就。', 'hash': '3665267419', 'name': '德瑞捷'},
    {'description': '完成所有《凌光之刻》成就。', 'hash': '79180995', 'name': '破碎凌霄'},
    {'description': '完成所有天选赛季成就。', 'hash': '1321008462', 'name': '天选者'},
    {'description': '来自“深岩墓室”的成就。', 'hash': '2960810718', 'name': '光影后裔'},
    {'description': '完成所有狂猎赛季成就。', 'hash': '1321008463', 'name': '守望者'},
    {'description': '完成《暗影要塞》的所有成就。', 'hash': '379405979', 'name': '先知'},
    {'description': '完成“救赎花园”突袭的所有成就。', 'hash': '1827854727', 'name': '证悟者'},
    {'description': '完成所有幽梦之城成就。', 'hash': '560097044', 'name': '破咒者'},
    {'description': '完成所有突袭成就。', 'hash': '1486062207', 'name': '魅痕克星'}
]

传承称号 = [{'hash': '1276693937', 'name': '天下无双', 'description': '完成所有狂猎赛季无瑕成就。'},
 {'hash': '581214566', 'name': '征服者', 'description': '完成所有第12赛季宗师成就。'},
 {'hash': '1210906310', 'name': '凯旋时刻2020', 'description': '在本赛季结束前完成这些光辉事迹来领取独特奖励。'},
 {'hash': '3212358005', 'name': '征服者', 'description': '完成影临赛季的所有宗师成就。'},
 {'hash': '3251218484', 'name': '天下无双', 'description': '完成影临赛季的所有无暇成就。'},
 {'hash': '1321008460', 'name': '先驱者', 'description': '完成影临赛季的所有成就。'},
 {'hash': '1376640684', 'name': '征服者', 'description': '完成所有英杰赛季宗师成就。'},
 {'hash': '2086100423', 'name': '天下无双', 'description': '完成所有英杰赛季完美无瑕成就。'},
 {'hash': '1321008461', 'name': '全知全能', 'description': '完成所有英杰赛季成就。'},
 {'hash': '955166375', 'name': '救世主', 'description': '完成黎明赛季的所有成就。'},
 {'hash': '955166374', 'name': '不朽', 'description': '完成不朽赛季的所有成就。'},
 {'hash': '1194128730', 'name': '凯旋时刻：MMXIX', 'description': '在2019年9月17日前，完成这些光辉事迹来领取你的独特奖励。'},
 {'hash': '717225803', 'name': '暗影', 'description': '完成所有丰盈赛季成就。'},
 {'hash': '2978379966', 'name': '决意者', 'description': '完成所有《莫测鬼牌》成就。'},
 {'hash': '450166688', 'name': '钢铁匠人', 'description': '完成所有黑色军械库成就。'},
 {'hash': '1106177979', 'name': '旅人', 'description': '完成所有目的地成就。'},
 {'hash': '3680676656', 'name': '编年史学家', 'description': '完成所有传奇故事成就。'}]




珍珠s = [
    '开门关，山洞处',
    '开门关，树旁',
    '汇流关卡前，左边小洞穴',
    '汇流关卡前，树上',
    '汇流关卡插旗处，左后方',
    '击败圣堂武士后，小洞口',
    '很下方的迷宫密道内',
    '戈尔贡迷宫内',
    '戈尔贡迷宫内',
    '跳跳乐右侧下方房间内',
    '跳跳乐左侧下方洞内',  # 11
    '守门人门口前的左上方',  # 12
]





# import asyncio
# import pydest

# API_KEY = '19a8efe4509a4570bee47bd9883f7d93'
# destiny = pydest.Pydest(API_KEY)

# async def fun1():
#     res1 = await destiny.decode_hash(616318467,'DestinyPresentationNodeDefinition')
#     dict1=[]
#     for res in res1['children']['presentationNodes']:
#         hashId = res['presentationNodeHash']
#         PresentationNode = await destiny.decode_hash(hashId,'DestinyPresentationNodeDefinition')
#         name = PresentationNode['displayProperties']['name']
#         description = PresentationNode['displayProperties']['description']
#         dict1.append(
#             {
#                 'hash':hashId,
#                 'name':name,
#                 'description':description
#             }
#         )
#     res2 = await destiny.decode_hash(1881970629,'DestinyPresentationNodeDefinition')
#     dict2=[]
#     for res in res2['children']['presentationNodes']:
#         hashId = res['presentationNodeHash']
#         PresentationNode = await destiny.decode_hash(hashId,'DestinyPresentationNodeDefinition')
#         name = PresentationNode['displayProperties']['name']
#         description = PresentationNode['displayProperties']['description']
#         dict2.append(
#             {
#                 'hash':hashId,
#                 'name':name,
#                 'description':description
#             }
#         )
#     print(dict2)
    
#     print(66)


# loop = asyncio.get_event_loop()
# loop.run_until_complete(fun1())
# loop.close()
